# how to retrive only few column in csv file

In [33]:
import pandas as pd

In [34]:
ufo=pd.read_csv('http://bit.ly/uforeports')

In [35]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [36]:
ufo=pd.read_csv('http://bit.ly/uforeports', usecols=[0,4])

In [37]:
ufo

                       City              Time
0                    Ithaca    6/1/1930 22:00
1               Willingboro   6/30/1930 20:00
2                   Holyoke   2/15/1931 14:00
3                   Abilene    6/1/1931 13:00
4      New York Worlds Fair   4/18/1933 19:00
...                     ...               ...
18236            Grant Park  12/31/2000 23:00
18237           Spirit Lake  12/31/2000 23:00
18238           Eagle River  12/31/2000 23:45
18239           Eagle River  12/31/2000 23:45
18240                  Ybor  12/31/2000 23:59

[18241 rows x 2 columns]

In [38]:
ufo=pd.read_csv('http://bit.ly/uforeports', nrows=3)

In [39]:
ufo

          City  Colors Reported Shape Reported State             Time
0       Ithaca              NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro              NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke              NaN           OVAL    CO  2/15/1931 14:00

In [40]:
# how to dataframes and series work with regard
#to selection individual entries and itrastion(for x usedata)

In [41]:
for i in ufo.City:
    print(i)

Ithaca
Willingboro
Holyoke

In [42]:
for index,  row in ufo.iterrows():
    print(index, row.City, row.State)

0 Ithaca NY
1 Willingboro NJ
2 Holyoke CO

In [43]:
drinks=pd.read_csv('http://bit.ly/drinksbycountry')

In [44]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [45]:
import numpy as np

In [46]:
drinks.select_dtypes(include=[np.number]).dtypes 
#only select number value

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

In [47]:
drinks=pd.read_csv('http://bit.ly/drinksbycountry', dtype={'beer_servings':float})
drinks.dtypes #change data type in csv file

country                          object
beer_servings                   float64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [48]:
drinks.describe(include='all' )

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
count,193,193.000000,193.000000,193.000000,193.000000,193
unique,193,NaN,NaN,NaN,NaN,6
top,Gambia,NaN,NaN,NaN,NaN,Africa
freq,1,NaN,NaN,NaN,NaN,53
mean,NaN,106.160622,80.994819,49.450777,4.717098,NaN
std,NaN,101.143103,88.284312,79.697598,3.773298,NaN
min,NaN,0.000000,0.000000,0.000000,0.000000,NaN
25%,NaN,20.000000,4.000000,1.000000,1.300000,NaN
50%,NaN,76.000000,56.000000,8.000000,4.200000,NaN
75%,NaN,188.000000,128.000000,59.000000,7.200000,NaN
max,NaN,376.000000,438.000000,370.000000,14.400000,NaN

In [49]:
drinks.describe(include=['object'])

       country continent
count      193       193
unique     193         6
top     Gambia    Africa
freq         1        53

In [50]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0.0,0,0,0.0,Asia
1,Albania,89.0,132,54,4.9,Europe
2,Algeria,25.0,0,14,0.7,Africa
3,Andorra,245.0,138,312,12.4,Europe
4,Angola,217.0,57,45,5.9,Africa

In [51]:
drinks.drop('continent', axis=1).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0.0,0,0,0.0
1,Albania,89.0,132,54,4.9
2,Algeria,25.0,0,14,0.7
3,Andorra,245.0,138,312,12.4
4,Angola,217.0,57,45,5.9

In [52]:
drinks.drop(2, axis=0).head() #drop rows

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0.0,0,0,0.0,Asia
1,Albania,89.0,132,54,4.9,Europe
3,Andorra,245.0,138,312,12.4,Europe
4,Angola,217.0,57,45,5.9,Africa
5,Antigua & Barbuda,102.0,128,45,4.9,North America

In [53]:
drinks.mean()

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64


# how to change data type of a pandas series

In [54]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0.0,0,0,0.0,Asia
1,Albania,89.0,132,54,4.9,Europe
2,Algeria,25.0,0,14,0.7,Africa
3,Andorra,245.0,138,312,12.4,Europe
4,Angola,217.0,57,45,5.9,Africa

In [55]:
drinks.dtypes

country                          object
beer_servings                   float64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [56]:
drinks['beer_servings']=drinks.beer_servings.astype(float)

In [57]:
drinks.dtypes

country                          object
beer_servings                   float64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

# group by in pandas

In [58]:
drinks.beer_servings.mean()

106.16062176165804

In [59]:
drinks.groupby('continent').beer_servings.mean() #all country

continent
Africa            61.471698
Asia              37.045455
Europe           193.777778
North America    145.434783
Oceania           89.687500
South America    175.083333
Name: beer_servings, dtype: float64

In [60]:
drinks[drinks.continent=='Africa'].beer_servings.mean() 
#only africa

61.471698113207545

In [61]:
drinks.groupby('continent').beer_servings.agg(['count','max','min','mean'])

               count    max   min        mean
continent
Africa            53  376.0   0.0   61.471698
Asia              44  247.0   0.0   37.045455
Europe            45  361.0   0.0  193.777778
North America     23  285.0   1.0  145.434783
Oceania           16  306.0   0.0   89.687500
South America     12  333.0  93.0  175.083333